
#include <stdio.h>
#include <locale.h>
#include <stdlib.h>

void name() {
    puts("********************************************************************************");
    puts("*                                                                              *");
    puts("*                       Лабораторная работа №1                                 *");
    puts("*                                                                              *");
    puts("********************************************************************************");
    puts(" Исполнитель:");
    puts(" Студент: Селиванов Эрик");
    puts(" Группа:  БИД-261");
    puts("--------------------------------------------------------------------------------\n");

    return 0;
}

void date() {
    puts(" Дата рождения (03.09.08):");
    puts("");
    puts("   /---\\         /---\\         /---\\         /---\\         /---\\         /---\\ ");
    puts("  |     |            /        |     |       |     |       |     |       |     |");
    puts("  |     |        /---/        |     |        \\----|       |     |       |-----|");
    puts("  |     |            \\        |     |             |       |     |       |     |");
    puts("   \\---/         \\---/         \\---/         \\----/        \\---/         \\---/ ");
    puts("");
    return 0;
}

int main() {
    setlocale(LC_CTYPE, ".UTF-8");
    puts("Нажмите Enter для продолжения...");
    getchar();
    name();
    date();
    puts("--------------------------------------------------------------------------------");
    puts("Нажмите Enter для завершения программы...");
    getchar();

    return 0;
}

